espressif/esp-idf/components/soc/esp32h21/register/soc/i2c_struct.h
/** Type of to register
 *  Timeout control register for receiving data
 */
typedef union {
    struct {
        /** time_out_value : R/W; bitpos: [4:0]; default: 16;
         *  Configures the timeout threshold period for SCL stucking at high or low level. The
         *  actual period is 2\^{}(reg_time_out_value).
         *  Measurement unit: I2C_SCLK
         */
        uint32_t time_out_value:5;
        /** time_out_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable timeout control.
         *  0: No effect
         *  1: Enable
         */
        uint32_t time_out_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} i2c_to_reg_t;

/** Type of slave_addr register
 *  Local slave address setting register
 */
typedef union {
    struct {
        /** slave_addr : R/W; bitpos: [14:0]; default: 0;
         *  Configures the slave address of the I2C slave.
         */
        uint32_t slave_addr:15;
        uint32_t reserved_15:16;
        /** addr_10bit_en : R/W; bitpos: [31]; default: 0;
         *  Configures whether to enable the slave 10-bit addressing mode in Master mode.
         *  0: No effect
         *  1: Enable
         */
        uint32_t addr_10bit_en:1;
    };
    uint32_t val;
} i2c_slave_addr_reg_t;

/** Type of fifo_conf register
 *  FIFO configuration register
 */
typedef union {
    struct {
        /** rxfifo_wm_thrhd : R/W; bitpos: [4:0]; default: 0;
         *  Configures the watermark threshold of RX FIFO in non-FIFO access mode. When
         *  I2C_FIFO_PRT_EN is 1 and RX FIFO counter is bigger than I2C_RXFIFO_WM_THRHD[4:0],
         *  the I2C_RXFIFO_WM_INT_RAW bit will be valid.
         */
        uint32_t rxfifo_wm_thrhd:5;
        /** txfifo_wm_thrhd : R/W; bitpos: [9:5]; default: 0;
         *  Configures the watermark threshold of TX FIFO in non-FIFO access mode.  When
         *  I2C_FIFO_PRT_EN is 1 and TC FIFO counter is bigger than I2C_TXFIFO_WM_THRHD[4:0],
         *  the I2C_TXFIFO_WM_INT_RAW bit will be valid.
         */
        uint32_t txfifo_wm_thrhd:5;
        /** nonfifo_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether to enable APB non-FIFO access.
         */
        uint32_t nonfifo_en:1;
        /** fifo_addr_cfg_en : R/W; bitpos: [11]; default: 0;
         *  Configures the slave to enable dual address mode. When this mode is enabled, the
         *  byte received after the I2C address byte represents the offset address in the I2C
         *  Slave RAM.
         *  0: Disable
         *  1: Enable
         */
        uint32_t fifo_addr_cfg_en:1;
        /** rx_fifo_rst : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to reset RX FIFO.
         *  0: No effect
         *  1: Reset
         */
        uint32_t rx_fifo_rst:1;
        /** tx_fifo_rst : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to reset TX FIFO.
         *  0: No effect
         *  1: Reset
         */
        uint32_t tx_fifo_rst:1;
        /** fifo_prt_en : R/W; bitpos: [14]; default: 0;
         *  Configures whether to enable FIFO pointer in non-FIFO access mode. This bit
         *  controls the valid bits and the TX/RX FIFO overflow, underflow, full and empty
         *  interrupts.
         *  0: No effect
         *  1: Enable
         */
        uint32_t fifo_prt_en:1;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} i2c_fifo_conf_reg_t;

/** Type of filter_cfg register
 *  SCL and SDA filter configuration register
 */
typedef union {
    struct {
        /** scl_filter_thres : R/W; bitpos: [3:0]; default: 0;
         *  Configures the threshold pulse width to be filtered on SCL. When a pulse on the SCL
         *  input has smaller width than this register value, the I2C controller will ignore
         *  that pulse.
         *  Measurement unit: I2C_SCLK
         */
        uint32_t scl_filter_thres:4;
        /** sda_filter_thres : R/W; bitpos: [7:4]; default: 0;
         *  Configures the threshold pulse width to be filtered on SDA. When a pulse on the SDA
         *  input has smaller width than this register value, the I2C controller will ignore
         *  that pulse.
         *  Measurement unit: I2C_SCLK
         */
        uint32_t sda_filter_thres:4;
        /** scl_filter_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether to enable the filter function for SCL.
         *  0: No effect
         *  1: Enable
         */
        uint32_t scl_filter_en:1;
        /** sda_filter_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether to enable the filter function for SDA.
         *  0: No effect
         *  1: Enable
         */
        uint32_t sda_filter_en:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} i2c_filter_cfg_reg_t;

/** Type of scl_sp_conf register
 *  Power configuration register
 */
typedef union {
    struct {
        /** scl_rst_slv_en : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether or not to send out SCL pulses when I2C master is IDLE. The
         *  number of pulses equals to I2C_SCL_RST_SLV_NUM[4:0].
         */
        uint32_t scl_rst_slv_en:1;
        /** scl_rst_slv_num : R/W; bitpos: [5:1]; default: 0;
         *  Configure the pulses of SCL generated in I2C Master mode.
         *  Valid when I2C_SCL_RST_SLV_EN is 1.
         *  Measurement unit: I2C_SCLK
         */
        uint32_t scl_rst_slv_num:5;
        /** scl_pd_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to power down the I2C output SCL line.
         *  0: Not power down
         *  1: Power down
         *  Valid only when I2C_SCL_FORCE_OUT is 1.
         */
        uint32_t scl_pd_en:1;
        /** sda_pd_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to power down the I2C output SDA line.
         *  0: Not power down
         *  1: Power down
         *  Valid only when I2C_SDA_FORCE_OUT is 1.
         */
        uint32_t sda_pd_en:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} i2c_scl_sp_conf_reg_t;

/** Type of scl_stretch_conf register
 *  SCL stretch setting register of I2C slave
 */
typedef union {
    struct {
        /** stretch_protect_num : R/W; bitpos: [9:0]; default: 0;
         *  Configures the time period to release the SCL line from stretching to avoid timing
         *  violation. Usually it should be larger than the SDA setup time.
         *  Measurement unit: I2C_SCLK
         */
        uint32_t stretch_protect_num:10;
        /** slave_scl_stretch_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether to enable slave SCL stretch function. The SCL output line will
         *  be stretched low when I2C_SLAVE_SCL_STRETCH_EN is 1 and stretch event happens. The
         *  stretch cause can be seen in I2C_STRETCH_CAUSE.
         *  0: Disable
         *  1: Enable
         */
        uint32_t slave_scl_stretch_en:1;
        /** slave_scl_stretch_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear the I2C slave SCL stretch function.
         *  0: No effect
         *  1: Clear
         */
        uint32_t slave_scl_stretch_clr:1;
        /** slave_byte_ack_ctl_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable the function for slave to control ACK level.
         *  0: Disable
         *  1: Enable
         */
        uint32_t slave_byte_ack_ctl_en:1;
        /** slave_byte_ack_lvl : R/W; bitpos: [13]; default: 0;
         *  Configures the ACK level when slave controlling ACK level function enables.
         *  0: Low level
         *  1: High level
         */
        uint32_t slave_byte_ack_lvl:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} i2c_scl_stretch_conf_reg_t;


/** Group: Status registers */
/** Type of sr register
 *  I2C working status register
 */
typedef union {
    struct {
        /** resp_rec : RO; bitpos: [0]; default: 0;
         *  Represents the received ACK value in Master mode or Slave mode.
         *  0: ACK
         *  1: NACK
         */
        uint32_t resp_rec:1;
        /** slave_rw : RO; bitpos: [1]; default: 0;
         *  Represents the transfer direction in Slave mode.
         *  0: Master writes to slave
         *  1: Master reads from slave
         */
        uint32_t slave_rw:1;
        uint32_t reserved_2:1;
        /** arb_lost : RO; bitpos: [3]; default: 0;
         *  Represents whether the I2C controller loses control of SCL line.
         *  0: No arbitration lost
         *  1: Arbitration lost
         */
        uint32_t arb_lost:1;
        /** bus_busy : RO; bitpos: [4]; default: 0;
         *  Represents the I2C bus state.
         *  0: The I2C bus is in idle state
         *  1: The I2C bus is busy transferring data
         */
        uint32_t bus_busy:1;
        /** slave_addressed : RO; bitpos: [5]; default: 0;
         *  Represents whether the address sent by the master is equal to the address of the
         *  slave.
         *  Valid only when the module is configured as an I2C Slave.
         *  0: Not equal
         *  1: Equal
         */
        uint32_t slave_addressed:1;
        uint32_t reserved_6:2;
        /** rxfifo_cnt : RO; bitpos: [13:8]; default: 0;
         *  Represents the number of data bytes received in RAM.
         */
        uint32_t rxfifo_cnt:6;
        /** stretch_cause : RO; bitpos: [15:14]; default: 0;
         *  Represents the cause of SCL clocking stretching in Slave mode.
         *  0: Stretching SCL low when the master starts to read data.
         *  1: Stretching SCL low when I2C TX FIFO is empty in Slave mode.
         *  2: Stretching SCL low when I2C RX FIFO is full in Slave mode.
         */
        uint32_t stretch_cause:2;
        uint32_t reserved_16:2;
        /** txfifo_cnt : RO; bitpos: [23:18]; default: 0;
         *  Represents the number of data bytes to be sent.
         */
        uint32_t txfifo_cnt:6;
        /** scl_main_state_last : RO; bitpos: [26:24]; default: 0;
         *  Represents the states of the I2C module state machine.
         *  0: Idle
         *  1: Address shift
         *  2: ACK address
         *  3: Rx data
         *  4: Tx data
         *  5: Send ACK
         *  6: Wait ACK
         */
        uint32_t scl_main_state_last:3;
        uint32_t reserved_27:1;
        /** scl_state_last : RO; bitpos: [30:28]; default: 0;
         *  Represents the states of the state machine used to produce SCL.
         *  0: Idle
         *  1: Start
         *  2: Negative edge
         *  3: Low
         *  4: Positive edge
         *  5: High
         *  6: Stop
         */
        uint32_t scl_state_last:3;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} i2c_sr_reg_t;

